
# !---cmd_start---!
msgs_cmd_start = {
    'user_is_auth': "🟢 Вы ўжо аўтарызаваны",

    'user_is_not_auth': "✋ Спачатку завершыце аўтарызацыю!",

    'demand_pass': "👇 Уведзіце пароль-фразу:"
}

msgs_process_password = {
    'successful_auth': "👍 Пароль дакладны! Вы аўтарызаваны.",

    'ban': "🔴 Перавышана колькасць спроб. Вы заблакаваны, вам тут няма чаго рабіць.",

    'invalid_pass': "🟡 Недакладны пароль. Засталося спроб: "
}
# !---cmd_start---! END

# !---cmd_create---!
msg_cmd_cancel = "❌ Cтварэнне новага дампу памяці адменена"

msg_cmd_photos = "👇 <b>Прыдумайце кароткую назву для суполкі фатаздымкаў (не болей 32 сімвалаў).</b>\n\n"\
                 "<i>Напрыклад назвай можа быць месца, дзе былі зроблены фатаздымкі, ці дата. Назва будзе адлюстроўвацца у спецыяльнай кнопке, таму яна павінна быць кароткай.</i>\n\n"\
                 "❌ адменіць стварэнне - /cancel"
msgs_process_title = {
    'title_too_long': "❗️ Назва занадта доўгая, дапускаецца максімум 32 сімвала. Паспрабуйце яшчэ раз 👇",

    'title_is_exist': "❗️ База дадзеных ужо мее такую назву. Прыдумайце іншую, унiкальную",

    'input_description': "👇 <b>Дадайце апісанне падзеі ці тое, што лічыце патрэбным тут.</b> <i>Уявіце, што буджеце чытаць гэта праз працяглы час</i>\n"
                         "❌ адменіць стварэнне - /cancel"
}

msg_process_description = "Загрузите фотографии (одну или несколько)\n"\     
                          "Когда закончите, введите команду - /save\n"\
                          "отменить - /cancel"


msg_save_dump = "❌ Вы не отправили ни одной фотографии перед сохранением!\n"\
                "Пожалуйста, отправьте фото, а затем используйте /save",

msg_wrong_input_in_photos_state = 'Неверный тип файлов. Бот принимает только файлы изображений, попробуйте заново'
# !---cmd_create---! END

# !---cmd_show---!
msg_cmd_show = "Список дампов:"
# !---cmd_show---! END

