
# !---cmd_start---!
msgs_cmd_start = {
    'user_is_auth': "🟢 Вы ўжо аўтарызаваны",

    'user_is_not_auth': "✋ Спачатку завершыце аўтарызацыю!",

    'demand_pass': "👇 Уведзіце пароль-фразу:"
}

msgs_process_password = {
    'successful_auth': "👍 Пароль дакладны! Вы аўтарызаваны.",

    'ban': "🔴 Перавышана колькасць спроб. Вы заблакаваны, больш вам тут няма чаго рабіць.",

    'invalid_pass': "🟡 Недакладны пароль. Засталося спроб: "
}
# !---cmd_start---! END

# !---cmd_create---!
msg_cmd_cancel = "❌ Адменена"

msg_cmd_photos = "👇 <b>Прыдумайце кароткую назву для каталога фатаздымкаў (не болей 32 сімвалаў):</b>\n\n"\
                 "<i>Напрыклад назвай можа быць месца, дзе былі зроблены фатаздымкі, ці дата падзеі. Назва будзе адлюстроўвацца у спецыяльнай кнопке, таму яна павінна быць кароткай.</i>\n\n"\
                 "❌ адменіць стварэнне - /cancel"
msgs_process_title = {
    'title_too_long': "❗️ Назва занадта доўгая, дапускаецца максімум 32 сімвала. Паспрабуйце яшчэ раз 👇",

    'title_is_exist': "❗️ База дадзеных ужо мее такую назву. Прыдумайце іншую, унiкальную",

    'input_description': "👇 <b>Дадайце апісанне:</b>\n\n<i>Любы тэкст, звязаны с падзеямі на фатаздымках.</i>\n\n"
                         "❌ адменіць - /cancel"
}

msg_process_description = "📤 <b>Загрузіце медыя-файлы:</b>\n\n" +\
                        "<i>Абярыце только наілепшыя фатаздымкі на ваш погляд. Памер дыска, на які адбываецца рэрервнае капіраванне, абмежаваны." \
                        "Таму калі ў вас напрыклад ёсць 5 фатаздымкаў, дзе адлюстравана амаль адно і тоеж, абярыце і загрузіце толькі адзін наілепшы, не пладзіце дублікаты.</i>\n\n"\
                        "💾 калі скончыце загрузку, уведзіце - /save\n" +\
                        "❌ адменіць - /cancel"


msg_save_dump = "️️️❗️ Вы не адправілі нігоднага файла.\nКалі ласка, адпраўце боту фота ці відэа, далей уведзіце каманду /save для стварэння новага дампу."

msg_wrong_input_in_photos_state = 'Неверный тип файлов. Бот принимает только файлы изображений'
# !---cmd_create---! END

# !---cmd_show---!
msg_cmd_show = "<b>🗄 Спіс дампаў для прагляду:</b>"
# !---cmd_show---! END

# !---cmd_edit---!
msg_cmd_edit = "<b>📝 Спіс дампаў для рэдактавання:</b>"
# !---cmd_edit---! END

# !---cmd_stop---!
msg_cmd_stop = "Дадзеныя аб вышым акаунце выдалены. Вы больш не будзеце атрымліваць ніякіх паведамленняў ад бота."
# !---cmd_stop---! END

msg_done = 'Зроблена ✅'

msg_edit_keyboard = {
    'add_description': "➕ Дадаць новы каментар",
    'add_files': '➕ Дадаць файлы'
}

def msg_handle_item_selection(title, description):
    message = ""
    message += "📌 " + "<b>" + title  + "\n\n</b>"
    descriptions = description.split('***')
    for description in descriptions:
        message += "<blockquote>" + description.strip() + "</blockquote>" + "\n"
    return message
